; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?drone - drone ?arm - arm ?crate - crate)
    (empty-arm ?drone - drone ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?drone ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (not (empty-arm ?drone ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (content-crate ?content ?crate)          
    )
    :effect (and 
        (not (has-crate-drone-arm ?drone ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?drone ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l39_p39_c39_g39_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	loc30 - location
	loc31 - location
	loc32 - location
	loc33 - location
	loc34 - location
	loc35 - location
	loc36 - location
	loc37 - location
	loc38 - location
	loc39 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	crate29 - crate
	crate30 - crate
	crate31 - crate
	crate32 - crate
	crate33 - crate
	crate34 - crate
	crate35 - crate
	crate36 - crate
	crate37 - crate
	crate38 - crate
	crate39 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
	person31 - person
	person32 - person
	person33 - person
	person34 - person
	person35 - person
	person36 - person
	person37 - person
	person38 - person
	person39 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(crate-at crate18 depot)
	(crate-at crate19 depot)
	(crate-at crate20 depot)
	(crate-at crate21 depot)
	(crate-at crate22 depot)
	(crate-at crate23 depot)
	(crate-at crate24 depot)
	(crate-at crate25 depot)
	(crate-at crate26 depot)
	(crate-at crate27 depot)
	(crate-at crate28 depot)
	(crate-at crate29 depot)
	(crate-at crate30 depot)
	(crate-at crate31 depot)
	(crate-at crate32 depot)
	(crate-at crate33 depot)
	(crate-at crate34 depot)
	(crate-at crate35 depot)
	(crate-at crate36 depot)
	(crate-at crate37 depot)
	(crate-at crate38 depot)
	(crate-at crate39 depot)
	(empty-arm drone1 left)
	(empty-arm drone1 right)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate food crate9)
	(content-crate food crate10)
	(content-crate food crate11)
	(content-crate food crate12)
	(content-crate food crate13)
	(content-crate food crate14)
	(content-crate food crate15)
	(content-crate food crate16)
	(content-crate food crate17)
	(content-crate food crate18)
	(content-crate food crate19)
	(content-crate food crate20)
	(content-crate food crate21)
	(content-crate food crate22)
	(content-crate food crate23)
	(content-crate food crate24)
	(content-crate medicine crate25)
	(content-crate medicine crate26)
	(content-crate medicine crate27)
	(content-crate medicine crate28)
	(content-crate medicine crate29)
	(content-crate medicine crate30)
	(content-crate medicine crate31)
	(content-crate medicine crate32)
	(content-crate medicine crate33)
	(content-crate medicine crate34)
	(content-crate medicine crate35)
	(content-crate medicine crate36)
	(content-crate medicine crate37)
	(content-crate medicine crate38)
	(content-crate medicine crate39)
	(person-at person1 loc27)
	(person-at person2 loc37)
	(person-at person3 loc7)
	(person-at person4 loc29)
	(person-at person5 loc6)
	(person-at person6 loc8)
	(person-at person7 loc15)
	(person-at person8 loc29)
	(person-at person9 loc5)
	(person-at person10 loc19)
	(person-at person11 loc33)
	(person-at person12 loc14)
	(person-at person13 loc35)
	(person-at person14 loc11)
	(person-at person15 loc32)
	(person-at person16 loc10)
	(person-at person17 loc21)
	(person-at person18 loc4)
	(person-at person19 loc2)
	(person-at person20 loc27)
	(person-at person21 loc35)
	(person-at person22 loc11)
	(person-at person23 loc2)
	(person-at person24 loc7)
	(person-at person25 loc19)
	(person-at person26 loc26)
	(person-at person27 loc39)
	(person-at person28 loc37)
	(person-at person29 loc27)
	(person-at person30 loc21)
	(person-at person31 loc25)
	(person-at person32 loc35)
	(person-at person33 loc17)
	(person-at person34 loc30)
	(person-at person35 loc29)
	(person-at person36 loc37)
	(person-at person37 loc28)
	(person-at person38 loc26)
	(person-at person39 loc16)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person2 food)
	(has-content-person person3 food)
	(has-content-person person5 medicine)
	(has-content-person person7 food)
	(has-content-person person7 medicine)
	(has-content-person person8 food)
	(has-content-person person9 food)
	(has-content-person person10 food)
	(has-content-person person10 medicine)
	(has-content-person person11 food)
	(has-content-person person12 food)
	(has-content-person person13 food)
	(has-content-person person13 medicine)
	(has-content-person person15 food)
	(has-content-person person15 medicine)
	(has-content-person person16 food)
	(has-content-person person16 medicine)
	(has-content-person person17 food)
	(has-content-person person17 medicine)
	(has-content-person person18 medicine)
	(has-content-person person19 food)
	(has-content-person person19 medicine)
	(has-content-person person20 food)
	(has-content-person person21 food)
	(has-content-person person22 medicine)
	(has-content-person person23 food)
	(has-content-person person23 medicine)
	(has-content-person person24 food)
	(has-content-person person26 medicine)
	(has-content-person person28 food)
	(has-content-person person29 medicine)
	(has-content-person person30 food)
	(has-content-person person34 food)
	(has-content-person person35 food)
	(has-content-person person35 medicine)
	(has-content-person person37 food)
	(has-content-person person37 medicine)
	(has-content-person person38 food)
))
)

; plan
1. (pick-up-crate crate39 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate39 depot)
   added: (has-crate-drone-arm drone1 right crate39)
   goals met: 1 of 40
2. (pick-up-crate crate24 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate24 depot)
   added: (has-crate-drone-arm drone1 left crate24)
   goals met: 1 of 40
3. (drone-move depot loc33 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc33)
   goals met: 0 of 40
4. (drop-crate loc33 person11 crate24 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate24)
   added: (has-content-person person11 food) (empty-arm drone1 left)
   goals met: 1 of 40
5. (drone-move loc33 depot drone1)
   deleted: (drone-at drone1 loc33)
   added: (drone-at drone1 depot)
   goals met: 2 of 40
6. (pick-up-crate crate23 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate23 depot)
   added: (has-crate-drone-arm drone1 left crate23)
   goals met: 2 of 40
7. (drone-move depot loc30 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc30)
   goals met: 1 of 40
8. (drop-crate loc30 person34 crate23 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate23)
   added: (has-content-person person34 food) (empty-arm drone1 left)
   goals met: 2 of 40
9. (drone-move loc30 depot drone1)
   deleted: (drone-at drone1 loc30)
   added: (drone-at drone1 depot)
   goals met: 3 of 40
10. (pick-up-crate crate22 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate22 depot)
   added: (has-crate-drone-arm drone1 left crate22)
   goals met: 3 of 40
11. (drone-move depot loc14 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc14)
   goals met: 2 of 40
12. (drop-crate loc14 person12 crate22 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate22)
   added: (has-content-person person12 food) (empty-arm drone1 left)
   goals met: 3 of 40
13. (drone-move loc14 depot drone1)
   deleted: (drone-at drone1 loc14)
   added: (drone-at drone1 depot)
   goals met: 4 of 40
14. (pick-up-crate crate21 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate21 depot)
   added: (has-crate-drone-arm drone1 left crate21)
   goals met: 4 of 40
15. (drone-move depot loc11 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc11)
   goals met: 3 of 40
16. (drop-crate loc11 person22 crate39 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate39)
   added: (has-content-person person22 medicine) (empty-arm drone1 right)
   goals met: 4 of 40
17. (drone-move loc11 depot drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 depot)
   goals met: 5 of 40
18. (pick-up-crate crate38 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate38 depot)
   added: (has-crate-drone-arm drone1 right crate38)
   goals met: 5 of 40
19. (drone-move depot loc6 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc6)
   goals met: 4 of 40
20. (drop-crate loc6 person5 crate38 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate38)
   added: (has-content-person person5 medicine) (empty-arm drone1 right)
   goals met: 5 of 40
21. (drone-move loc6 depot drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 depot)
   goals met: 6 of 40
22. (pick-up-crate crate37 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate37 depot)
   added: (has-crate-drone-arm drone1 right crate37)
   goals met: 6 of 40
23. (drone-move depot loc5 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc5)
   goals met: 5 of 40
24. (drop-crate loc5 person9 crate21 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate21)
   added: (has-content-person person9 food) (empty-arm drone1 left)
   goals met: 6 of 40
25. (drone-move loc5 depot drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 depot)
   goals met: 7 of 40
26. (pick-up-crate crate20 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate20 depot)
   added: (has-crate-drone-arm drone1 left crate20)
   goals met: 7 of 40
27. (drone-move depot loc4 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc4)
   goals met: 6 of 40
28. (drop-crate loc4 person18 crate37 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate37)
   added: (has-content-person person18 medicine) (empty-arm drone1 right)
   goals met: 7 of 40
29. (drone-move loc4 depot drone1)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 depot)
   goals met: 8 of 40
30. (pick-up-crate crate36 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate36 depot)
   added: (has-crate-drone-arm drone1 right crate36)
   goals met: 8 of 40
31. (drone-move depot loc37 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc37)
   goals met: 7 of 40
32. (drop-crate loc37 person2 crate20 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate20)
   added: (has-content-person person2 food) (empty-arm drone1 left)
   goals met: 8 of 40
33. (drone-move loc37 depot drone1)
   deleted: (drone-at drone1 loc37)
   added: (drone-at drone1 depot)
   goals met: 9 of 40
34. (pick-up-crate crate19 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate19 depot)
   added: (has-crate-drone-arm drone1 left crate19)
   goals met: 9 of 40
35. (drone-move depot loc37 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc37)
   goals met: 8 of 40
36. (drop-crate loc37 person28 crate19 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate19)
   added: (has-content-person person28 food) (empty-arm drone1 left)
   goals met: 9 of 40
37. (drone-move loc37 depot drone1)
   deleted: (drone-at drone1 loc37)
   added: (drone-at drone1 depot)
   goals met: 10 of 40
38. (pick-up-crate crate18 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate18 depot)
   added: (has-crate-drone-arm drone1 left crate18)
   goals met: 10 of 40
39. (drone-move depot loc35 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc35)
   goals met: 9 of 40
40. (drop-crate loc35 person13 crate18 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate18)
   added: (has-content-person person13 food) (empty-arm drone1 left)
   goals met: 10 of 40
41. (drone-move loc35 depot drone1)
   deleted: (drone-at drone1 loc35)
   added: (drone-at drone1 depot)
   goals met: 11 of 40
42. (pick-up-crate crate17 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate17 depot)
   added: (has-crate-drone-arm drone1 left crate17)
   goals met: 11 of 40
43. (drone-move depot loc35 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc35)
   goals met: 10 of 40
44. (drop-crate loc35 person21 crate17 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate17)
   added: (has-content-person person21 food) (empty-arm drone1 left)
   goals met: 11 of 40
45. (drop-crate loc35 person13 crate36 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate36)
   added: (has-content-person person13 medicine) (empty-arm drone1 right)
   goals met: 12 of 40
46. (drone-move loc35 depot drone1)
   deleted: (drone-at drone1 loc35)
   added: (drone-at drone1 depot)
   goals met: 13 of 40
47. (pick-up-crate crate35 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate35 depot)
   added: (has-crate-drone-arm drone1 right crate35)
   goals met: 13 of 40
48. (pick-up-crate crate16 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate16 depot)
   added: (has-crate-drone-arm drone1 left crate16)
   goals met: 13 of 40
49. (drone-move depot loc32 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc32)
   goals met: 12 of 40
50. (drop-crate loc32 person15 crate16 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate16)
   added: (has-content-person person15 food) (empty-arm drone1 left)
   goals met: 13 of 40
51. (drop-crate loc32 person15 crate35 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate35)
   added: (has-content-person person15 medicine) (empty-arm drone1 right)
   goals met: 14 of 40
52. (drone-move loc32 depot drone1)
   deleted: (drone-at drone1 loc32)
   added: (drone-at drone1 depot)
   goals met: 15 of 40
53. (pick-up-crate crate34 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate34 depot)
   added: (has-crate-drone-arm drone1 right crate34)
   goals met: 15 of 40
54. (pick-up-crate crate15 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate15 depot)
   added: (has-crate-drone-arm drone1 left crate15)
   goals met: 15 of 40
55. (drone-move depot loc29 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc29)
   goals met: 14 of 40
56. (drop-crate loc29 person8 crate15 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate15)
   added: (has-content-person person8 food) (empty-arm drone1 left)
   goals met: 15 of 40
57. (drone-move loc29 depot drone1)
   deleted: (drone-at drone1 loc29)
   added: (drone-at drone1 depot)
   goals met: 16 of 40
58. (pick-up-crate crate14 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate14 depot)
   added: (has-crate-drone-arm drone1 left crate14)
   goals met: 16 of 40
59. (drone-move depot loc29 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc29)
   goals met: 15 of 40
60. (drop-crate loc29 person35 crate14 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate14)
   added: (has-content-person person35 food) (empty-arm drone1 left)
   goals met: 16 of 40
61. (drop-crate loc29 person35 crate34 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate34)
   added: (has-content-person person35 medicine) (empty-arm drone1 right)
   goals met: 17 of 40
62. (drone-move loc29 depot drone1)
   deleted: (drone-at drone1 loc29)
   added: (drone-at drone1 depot)
   goals met: 18 of 40
63. (pick-up-crate crate33 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate33 depot)
   added: (has-crate-drone-arm drone1 right crate33)
   goals met: 18 of 40
64. (pick-up-crate crate13 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate13 depot)
   added: (has-crate-drone-arm drone1 left crate13)
   goals met: 18 of 40
65. (drone-move depot loc28 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc28)
   goals met: 17 of 40
66. (drop-crate loc28 person37 crate13 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate13)
   added: (has-content-person person37 food) (empty-arm drone1 left)
   goals met: 18 of 40
67. (drop-crate loc28 person37 crate33 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate33)
   added: (has-content-person person37 medicine) (empty-arm drone1 right)
   goals met: 19 of 40
68. (drone-move loc28 depot drone1)
   deleted: (drone-at drone1 loc28)
   added: (drone-at drone1 depot)
   goals met: 20 of 40
69. (pick-up-crate crate32 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate32 depot)
   added: (has-crate-drone-arm drone1 right crate32)
   goals met: 20 of 40
70. (pick-up-crate crate12 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate12 depot)
   added: (has-crate-drone-arm drone1 left crate12)
   goals met: 20 of 40
71. (drone-move depot loc27 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc27)
   goals met: 19 of 40
72. (drop-crate loc27 person1 crate12 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate12)
   added: (has-content-person person1 food) (empty-arm drone1 left)
   goals met: 20 of 40
73. (drone-move loc27 depot drone1)
   deleted: (drone-at drone1 loc27)
   added: (drone-at drone1 depot)
   goals met: 21 of 40
74. (pick-up-crate crate11 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate11 depot)
   added: (has-crate-drone-arm drone1 left crate11)
   goals met: 21 of 40
75. (drone-move depot loc27 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc27)
   goals met: 20 of 40
76. (drop-crate loc27 person20 crate11 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate11)
   added: (has-content-person person20 food) (empty-arm drone1 left)
   goals met: 21 of 40
77. (drop-crate loc27 person29 crate32 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate32)
   added: (has-content-person person29 medicine) (empty-arm drone1 right)
   goals met: 22 of 40
78. (drone-move loc27 depot drone1)
   deleted: (drone-at drone1 loc27)
   added: (drone-at drone1 depot)
   goals met: 23 of 40
79. (pick-up-crate crate31 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate31 depot)
   added: (has-crate-drone-arm drone1 right crate31)
   goals met: 23 of 40
80. (pick-up-crate crate10 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate10 depot)
   added: (has-crate-drone-arm drone1 left crate10)
   goals met: 23 of 40
81. (drone-move depot loc26 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc26)
   goals met: 22 of 40
82. (drop-crate loc26 person38 crate10 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate10)
   added: (has-content-person person38 food) (empty-arm drone1 left)
   goals met: 23 of 40
83. (drop-crate loc26 person26 crate31 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate31)
   added: (has-content-person person26 medicine) (empty-arm drone1 right)
   goals met: 24 of 40
84. (drone-move loc26 depot drone1)
   deleted: (drone-at drone1 loc26)
   added: (drone-at drone1 depot)
   goals met: 25 of 40
85. (pick-up-crate crate30 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate30 depot)
   added: (has-crate-drone-arm drone1 right crate30)
   goals met: 25 of 40
86. (pick-up-crate crate9 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate9 depot)
   added: (has-crate-drone-arm drone1 left crate9)
   goals met: 25 of 40
87. (drone-move depot loc21 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc21)
   goals met: 24 of 40
88. (drop-crate loc21 person17 crate9 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate9)
   added: (has-content-person person17 food) (empty-arm drone1 left)
   goals met: 25 of 40
89. (drone-move loc21 depot drone1)
   deleted: (drone-at drone1 loc21)
   added: (drone-at drone1 depot)
   goals met: 26 of 40
90. (pick-up-crate crate8 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate8 depot)
   added: (has-crate-drone-arm drone1 left crate8)
   goals met: 26 of 40
91. (drone-move depot loc21 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc21)
   goals met: 25 of 40
92. (drop-crate loc21 person30 crate8 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate8)
   added: (has-content-person person30 food) (empty-arm drone1 left)
   goals met: 26 of 40
93. (drop-crate loc21 person17 crate30 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate30)
   added: (has-content-person person17 medicine) (empty-arm drone1 right)
   goals met: 27 of 40
94. (drone-move loc21 depot drone1)
   deleted: (drone-at drone1 loc21)
   added: (drone-at drone1 depot)
   goals met: 28 of 40
95. (pick-up-crate crate29 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate29 depot)
   added: (has-crate-drone-arm drone1 right crate29)
   goals met: 28 of 40
96. (pick-up-crate crate7 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate7 depot)
   added: (has-crate-drone-arm drone1 left crate7)
   goals met: 28 of 40
97. (drone-move depot loc19 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc19)
   goals met: 27 of 40
98. (drop-crate loc19 person10 crate7 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate7)
   added: (has-content-person person10 food) (empty-arm drone1 left)
   goals met: 28 of 40
99. (drop-crate loc19 person10 crate29 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate29)
   added: (has-content-person person10 medicine) (empty-arm drone1 right)
   goals met: 29 of 40
100. (drone-move loc19 depot drone1)
   deleted: (drone-at drone1 loc19)
   added: (drone-at drone1 depot)
   goals met: 30 of 40
101. (pick-up-crate crate28 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate28 depot)
   added: (has-crate-drone-arm drone1 right crate28)
   goals met: 30 of 40
102. (pick-up-crate crate6 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate6 depot)
   added: (has-crate-drone-arm drone1 left crate6)
   goals met: 30 of 40
103. (drone-move depot loc15 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc15)
   goals met: 29 of 40
104. (drop-crate loc15 person7 crate6 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate6)
   added: (has-content-person person7 food) (empty-arm drone1 left)
   goals met: 30 of 40
105. (drop-crate loc15 person7 crate28 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate28)
   added: (has-content-person person7 medicine) (empty-arm drone1 right)
   goals met: 31 of 40
106. (drone-move loc15 depot drone1)
   deleted: (drone-at drone1 loc15)
   added: (drone-at drone1 depot)
   goals met: 32 of 40
107. (pick-up-crate crate27 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate27 depot)
   added: (has-crate-drone-arm drone1 right crate27)
   goals met: 32 of 40
108. (pick-up-crate crate5 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate5 depot)
   added: (has-crate-drone-arm drone1 left crate5)
   goals met: 32 of 40
109. (drone-move depot loc10 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc10)
   goals met: 31 of 40
110. (drop-crate loc10 person16 crate5 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate5)
   added: (has-content-person person16 food) (empty-arm drone1 left)
   goals met: 32 of 40
111. (drop-crate loc10 person16 crate27 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate27)
   added: (has-content-person person16 medicine) (empty-arm drone1 right)
   goals met: 33 of 40
112. (drone-move loc10 depot drone1)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 depot)
   goals met: 34 of 40
113. (pick-up-crate crate26 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate26 depot)
   added: (has-crate-drone-arm drone1 right crate26)
   goals met: 34 of 40
114. (pick-up-crate crate4 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate4 depot)
   added: (has-crate-drone-arm drone1 left crate4)
   goals met: 34 of 40
115. (drone-move depot loc7 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc7)
   goals met: 33 of 40
116. (drop-crate loc7 person3 crate4 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate4)
   added: (has-content-person person3 food) (empty-arm drone1 left)
   goals met: 34 of 40
117. (drone-move loc7 depot drone1)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 depot)
   goals met: 35 of 40
118. (pick-up-crate crate3 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate3 depot)
   added: (has-crate-drone-arm drone1 left crate3)
   goals met: 35 of 40
119. (drone-move depot loc7 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc7)
   goals met: 34 of 40
120. (drop-crate loc7 person24 crate3 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate3)
   added: (has-content-person person24 food) (empty-arm drone1 left)
   goals met: 35 of 40
121. (drone-move loc7 depot drone1)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 depot)
   goals met: 36 of 40
122. (pick-up-crate crate2 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate2 depot)
   added: (has-crate-drone-arm drone1 left crate2)
   goals met: 36 of 40
123. (drone-move depot loc2 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc2)
   goals met: 35 of 40
124. (drop-crate loc2 person19 crate2 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate2)
   added: (has-content-person person19 food) (empty-arm drone1 left)
   goals met: 36 of 40
125. (drone-move loc2 depot drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 depot)
   goals met: 37 of 40
126. (pick-up-crate crate1 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate1 depot)
   added: (has-crate-drone-arm drone1 left crate1)
   goals met: 37 of 40
127. (drone-move depot loc2 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc2)
   goals met: 36 of 40
128. (drop-crate loc2 person23 crate1 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate1)
   added: (has-content-person person23 food) (empty-arm drone1 left)
   goals met: 37 of 40
129. (drop-crate loc2 person19 crate26 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate26)
   added: (has-content-person person19 medicine) (empty-arm drone1 right)
   goals met: 38 of 40
130. (drone-move loc2 depot drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 depot)
   goals met: 39 of 40
131. (pick-up-crate crate25 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate25 depot)
   added: (has-crate-drone-arm drone1 right crate25)
   goals met: 39 of 40
132. (drone-move depot loc2 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc2)
   goals met: 38 of 40
133. (drop-crate loc2 person23 crate25 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate25)
   added: (has-content-person person23 medicine) (empty-arm drone1 right)
   goals met: 39 of 40
134. (drone-move loc2 depot drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 depot)
   goals met: 40 of 40
